LiChunM/m203c_sdk_vport_v1.2/cloud/zyf_mqtt_tracker_app/zyf_custom/m203c_module.c
#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include "ql_trace.h"
#include "ql_uart.h"
#include "ql_system.h"
#include "ql_stdlib.h"
#include "ql_error.h"
#include "ql_gpio.h"
#include "sys.h"
#include "ril.h"
#include "ql_socket.h"
#include "m203c_module.h"
#include "m203c_module_cfg.h"
#include "m203c_module_at.h"
#include "uart.h"

#if 1
#define at_print(format, ...) mprintf( format, ##__VA_ARGS__)
// 调试信息:
#define at_printl(format, ...) mprintf( format "\r\n", ##__VA_ARGS__)
#define at_printe(format, ...) mprintf( format "\r\n", ##__VA_ARGS__)
// 解析函数中的调试信息和错误信息
#define at_printd(format, ...) mprintf(format "\r\n", ##__VA_ARGS__)
// gnss 调试信息
#define gnss_printl(format, ...) mprintf( format "\r\n", ##__VA_ARGS__)
// tcp/ssl 打印信息
#define tcp_printl(format, ...) mprintf( format "\r\n", ##__VA_ARGS__)
#define tcp_printd(format, ...) mprintf( format "\r\n", ##__VA_ARGS__)
#endif
#define SYSTEM_DELAY_MS(nms) Ql_Sleep(nms)


u8 SSLWRITESTA=0;



static char at_cmd_buf[AT_CMD_LEN_MAX];
static char at_resp_buf[AT_RESP_LEN_MAX];
static char at_ret_data[32];
static tcpip_recv_t tcpip_recv;


// 判断字符串是ip地址还是域名,返回0为ip，否则为域名
int32_t is_ip_domain(const char* psz)
{
    uint8_t i;
    const char* b = psz;
#if 0
    // 判断前4个是否是字符
    for (i = 0; i < 4; i++)
    {
        if (0 == isprint(*(psz + i)))
        {
            return 0xff;
        }
    }
#endif
    // 超过15个字符 一定不是ip无疑了
    if (Ql_strlen(psz) > 15 || Ql_strlen(psz) < 7)
    {
        return 1;
    }
    i = 0;
    while (*psz)
    {
        if (*psz == '.')
        {
            if (psz - b < 1)
            {
                return 2;
            }
            if (psz - b > 1 && *b == '0')
            {
                return 3;
            }
            if (Ql_atoi(b) > 255)
            {
                return 4;
            }
            i++;
            b = psz + 1;
        }
        else if (!isdigit(*psz))
        {
            return 5;
        }
        psz++;
    }
    if (i != 3)
    {
        return 6;
    }
    if (psz - b < 1)
    {
        return 7;
    }
    if (psz - b > 1 && *b == '0')
    {
        return 8;
    }
    if (Ql_atoi(b) > 255)
    {
        return 9;
    }
    return 0;
}


static s32 AT_resp_parser_generic(char* line, u32 len, void* userData)
{
    at_print("%s",line);
    
    if (Ql_RIL_FindLine(line, len, "OK"))
    {  
        return  RIL_ATRSP_SUCCESS;
    }
    else if (Ql_RIL_FindLine(line, len, "ERROR"))
    {  
        return  RIL_ATRSP_FAILED;
    }
    else if (Ql_RIL_FindString(line, len, "+CME ERROR"))
    {
        return  RIL_ATRSP_FAILED;
    }
    else if (Ql_RIL_FindString(line, len, "+CMS ERROR:"))
    {
        return  RIL_ATRSP_FAILED;
    }
    return RIL_ATRSP_CONTINUE;
}

static s32 AT_resp_parser_QSECWRITE(char* line, u32 len, void* userData)
{
    char* p = NULL;
	 at_print("%s",line);
    // CONNECT
    if (userData == NULL)
    {
        p = Ql_strstr(line, "\r\nCONNECT\r\n");
        if ((p != NULL) && (p < (line + len)))
        {
            return RIL_ATRSP_SUCCESS;
        }
	  else if (Ql_RIL_FindLine(line, len, "ERROR"))
	    {  
	        return  RIL_ATRSP_FAILED;
	    }
	   else if (Ql_RIL_FindString(line, len, "+CME ERROR"))
	    {
	        return  RIL_ATRSP_FAILED;
	    }
	   at_printd("error %d", __LINE__);

    }
    return RIL_ATRSP_CONTINUE;
}


static s32 AT_resp_parser_QIMUX(char* resp, uint32_t index, void* userdata)
{
    uint32_t* mode = userdata;
	 at_print("%s",resp);
    if (mode == NULL)
    {
        return AT_resp_parser_generic(resp, index, NULL);
    }
    if (Ql_sscanf(resp, "\r\n+QIMUX: %d\r\n", mode) >= 1)
    {
        at_printd("mux=%d", *mode);
        if ((*mode == 0) || (*mode == 1))
        {
            //*userdata = mode;
            return RIL_ATRSP_SUCCESS;
        }
    }
	else if (Ql_RIL_FindLine(resp, index, "ERROR"))
    {  
        return  RIL_ATRSP_FAILED;
    }
    else if (Ql_RIL_FindString(resp, index, "+CME ERROR"))
    {
        return  RIL_ATRSP_FAILED;
    }
    return RIL_ATRSP_CONTINUE;
}

static s32 AT_resp_parser_QIMODE(char* resp, uint32_t index, void* userdata)
{
    uint32_t* mode = userdata;
	 at_print("%s",resp);
    if (mode == NULL)
    {
        return AT_resp_parser_generic(resp, index, userdata);
    }
    if (Ql_sscanf(resp, "\r\n+QIMODE: %d\r\n", mode) >= 1)
    {
        at_printd("imode=%d", *mode);
        if ((*mode == 0) || (*mode == 1))
        {
            //*userdata = mode;
            return RIL_ATRSP_SUCCESS;
        }
    }
	else if (Ql_RIL_FindLine(resp, index, "ERROR"))
    {  
        return  RIL_ATRSP_FAILED;
    }
    else if (Ql_RIL_FindString(resp, index, "+CME ERROR"))
    {
        return  RIL_ATRSP_FAILED;
    }
    return RIL_ATRSP_CONTINUE;
}


static s32 AT_resp_parser_QIDEACT(char* resp, uint32_t index, void* userdata)
{
    char* p;
    /*
    响应
    如果关闭成功返回：
    DEACT OK
    如果关闭失败，返回：
    ERROR
    最大响应时间:40s，受网络状态影响
    */
    at_print("%s", resp);
    p = Ql_strstr(resp, "DEACT OK");
    if ((p != NULL) && (p < (resp + index)))
    {
        return RIL_ATRSP_SUCCESS;
    }
	else if (Ql_RIL_FindLine(resp, index, "ERROR"))
    {  
        return  RIL_ATRSP_FAILED;
    }
    else if (Ql_RIL_FindString(resp, index, "+CME ERROR"))
    {
        return  RIL_ATRSP_FAILED;
    }
    return RIL_ATRSP_CONTINUE;
}

static s32 AT_resp_parser_CSQ(char* resp, uint32_t index, void* userdata)
{
    int32_t rssi_val, b, c, d;
    int32_t in = 0;
    int32_t in2 = 0;
    int32_t j = 0;
    char* p[16];
    char* q[16];
    char* buf = resp;
    char* inner_ptr = NULL;
	
	at_printd("%s", resp);
	
    while ((p[in] = strtok_r(buf, ":", &inner_ptr)) != NULL)
    {
        in++;
        buf = NULL;
    }
#if AT_DEBUG_VERBOSE
    at_printd("1st, now we have %d strings:\n", in);
    for (j = 0; j < in; j++)
    {
        at_printd("p[%d] =  %s", j, p[j]);
    }
#endif
    // 第二个字符串 p[1] 就是包含有信号质量数值的
    if (in >= 2)
    {
        while ((q[in2] = strtok_r(p[1], ",", &inner_ptr)) != NULL)
        {
            in2++;
            p[1] = NULL;
        }
#if AT_DEBUG_VERBOSE
        at_printd("2nd, now we have %d strings:\n", in2);
        for (j = 0; j < in2; j++)
        {
            at_printd("q[%d] =  %s", j, q[j]);
        }
#endif
        if (in2 >= 2)
        {
            rssi_val = Ql_atoi(q[0]);
            b = Ql_atoi(q[1]);
            //gprs_csq = (uint8_t)rssi_val;
            return RIL_ATRSP_SUCCESS;
        }
    }
    return RIL_ATRSP_CONTINUE;
}

static s32 AT_resp_parser_CPIN(char* resp, uint32_t index, void* userdata)
{
    char* p = NULL;
	 at_print("%s",resp);
    p = Ql_strstr(resp, "+CPIN: READY");
    if ((p != NULL) && (p < (resp + index)))
    {
        return RIL_ATRSP_SUCCESS;
    }
   else if (Ql_RIL_FindLine(resp, index, "ERROR"))
    {  
        return  RIL_ATRSP_FAILED;
    }
    else if (Ql_RIL_FindString(resp, index, "+CME ERROR"))
    {
        return  RIL_ATRSP_FAILED;
    }
	return RIL_ATRSP_CONTINUE;
}

s32 AT_resp_parse_QILOCIP(char* resp, uint32_t index, void* userdata)
{
	u8 j;
    uint32_t in = 0;
    char* p[4] = { NULL, NULL, NULL, NULL };
    char* buf = resp;
    char* inner_ptr = NULL;
	 at_print("%s",resp);
    while ((p[in] = strtok_r(buf, ".", &inner_ptr)) != NULL)
    {
        in++;
        buf = NULL;
    }
#if AT_DEBUG_VERBOSE
    for (j = 0; j < in; j++)
    {
        at_printd("p[%d] =  %s\r\n", j, p[j]);
    }
#endif
    if (in >= 3)
    {
        // 取值范围判断
        // a = atoi(p[0]);
        // b = atoi(p[1]);
        // c = atoi(p[2]);
        // d = atoi(p[3]);
        return RIL_ATRSP_SUCCESS;
    }
    else
    {
        return RIL_ATRSP_FAILED;
    }
}


static s32 AT_resp_parser_QIDNSIP(char* resp, uint32_t index, void* userdata)
{
    uint32_t* mode = userdata;

