LiChunM/m203c_sdk_vport_v1.2/cloud/zyf_mqtt_tracker_app/zyf_custom/m203c_module.c
	 at_printd("%s", *resp);
	
    if (mode == NULL)
    {
        return AT_resp_parser_generic(resp, index, NULL);
    }
    if (Ql_sscanf(resp, "\r\n+QIDNSIP: %d\r\n", mode) >= 1)
    {
        at_printd("dnsip=%d", *mode);
        if ((*mode == 0) || (*mode == 1))
        {
            //*userdata = mode;
            return RIL_ATRSP_SUCCESS;
        }
    }
    return RIL_ATRSP_FAILED;
}

static s32 AT_resp_parser_QISEND_Prepare(char* resp, uint32_t index, void* userdata)
{
    char* p = NULL;
	 at_print("%s",resp);
    if (index > 0)
    {
        // ATV1
        p = Ql_strstr(resp, ">");
    }
    if ((p != NULL) && (p < (resp + index)))
    {
        return RIL_ATRSP_SUCCESS;
    }
    return RIL_ATRSP_FAILED;
}

u8 QSSLRECV[500]={0};

static int32_t AT_resp_parser_QSSLRECV(char* resp, uint32_t index, void* userdata)
{
    tcpip_recv_t* p_ssl_recv = userdata;
    uint8_t* ptrmsg = NULL;
    uint8_t* head = NULL;
    uint8_t* data_ptr = NULL;
	char* myhead = NULL;

	 Ql_strncat((char*)QSSLRECV,resp,Ql_strlen(resp));
	 myhead = (u8*)strstr((const char*)QSSLRECV,"message");
	 if(myhead)
		{
				at_print("%s",QSSLRECV);
#if 1
			    // 解析出读取到的实际数据长度和数据
			    if (head = Ql_strstr(QSSLRECV, ",TCP,"))
			    {
			        ptrmsg = head + 5;
			        p_ssl_recv->act_length = Ql_atoi(ptrmsg);
			        at_printd("len=%d", p_ssl_recv->act_length);
			        data_ptr = Ql_strstr(ptrmsg, "\r\n");
			        if (data_ptr)
			        {
			            data_ptr += 2;
			            Ql_memcpy(p_ssl_recv->data_ptr, data_ptr, p_ssl_recv->act_length);
			            return RIL_ATRSP_SUCCESS;
			        }
			    }
#endif
			 return  RIL_ATRSP_FAILED;
		}
	else
		{
			if (Ql_RIL_FindLine(resp, index, "ERROR"))
		    {  
		        return  RIL_ATRSP_FAILED;
		    }		
			return  RIL_ATRSP_CONTINUE;
		}	
    return RIL_ATRSP_CONTINUE;
}

static int32_t AT_resp_parser_QISTAT(char* resp, uint32_t index, void* userdata)
{
    uint32_t in = 0;
    uint32_t j = 0;
    char* p[4] = { NULL, NULL, NULL, NULL };
    char* buf = resp;
    char* inner_ptr = NULL;
    char* outer_ptr;
#if 1
    at_printd("TODO %s", __FUNCTION__);
    return RIL_ATRSP_SUCCESS;
#endif
    while ((p[in] = strtok_r(buf, "\r", &inner_ptr)) != NULL)
    {
        in++;
        buf = NULL;
    }
    // 如果正常 将会拆分出3个字符串 分别为指令执行状态码，tcp状态码，结束符 <lf>
    if (in >= 3)
    {
#if AT_DEBUG_VERBOSE
        for (j = 0; j < in; j++)
        {
            at_printd("p[%d] %#x\r\n", j, *p[j]);
        }
#endif
        at_printd("IPState = %#x", *p[1]);
        //        g_gprs_state.ipstate = *p[1];
        return RIL_ATRSP_SUCCESS;
    }
    else
    {
        return RIL_ATRSP_FAILED;
    }
}

static int32_t AT_resp_parser_QICLOSE(char* resp, uint32_t index, void* userdata)
{
    char* p = NULL;
	 at_print("%s",resp);
    p = Ql_strstr(resp, "CLOSE OK");
    if ((p != NULL) && (p < (resp + index)))
    {
        //        g_gprs_state.ipstate = GPRS_STATE_IP_CLOSE;
        return RIL_ATRSP_SUCCESS;
    }
    return RIL_ATRSP_FAILED;
}

static int32_t AT_resp_parser_GSN(char* resp, uint32_t index, void* userdata)
{
    char* gprs_imei = userdata;
   if (Ql_RIL_FindLine(resp, index, "ERROR"))
		    {  
		        return  RIL_ATRSP_FAILED;
		    }	
    if (Ql_sscanf(resp, "\r\n%s\r\nOK\r\n", gprs_imei) >= 1)
    {
        at_printd("imei=%s", gprs_imei);
        return RIL_ATRSP_SUCCESS;
    }
    at_printd("imei error");
    return RIL_ATRSP_CONTINUE;
}
static int32_t AT_resp_parser_CIMI(char* resp, uint32_t index, void* userdata)
{
    char* gprs_imsi = userdata;
  if (Ql_RIL_FindLine(resp, index, "ERROR"))
		    {  
		        return  RIL_ATRSP_FAILED;
		    }	
    if (Ql_sscanf(resp, "\r\n%s\r\nOK\r\n", gprs_imsi) >= 1)
    {
        at_printd("imsi=%s", gprs_imsi);
        return RIL_ATRSP_SUCCESS;
    }
    at_printd("imsi error");
    return RIL_ATRSP_CONTINUE;
}

static int32_t AT_resp_parser_QCCID(char* resp, uint32_t index, void* userdata)
{
    char* gprs_ccid = userdata;
   if (Ql_RIL_FindLine(resp, index, "ERROR"))
		    {  
		        return  RIL_ATRSP_FAILED;
		    }	
    if (Ql_sscanf(resp, "\r\n%s\r\nOK\r\n", gprs_ccid) >= 1)
    {
        at_printd("ccid=%s", gprs_ccid);
        return RIL_ATRSP_SUCCESS;
    }
    at_printd("ccid error");
    return RIL_ATRSP_CONTINUE;
}


static s32 AT_cmd_send(const char* atCmd, u32 atCmdLen,Callback_ATResponse atRsp_callBack, void* userData, u32 timeout_ms)
{
	at_print("%s\r\n",atCmd);
	return Ql_RIL_SendATCmd(atCmd, atCmdLen, atRsp_callBack, userData,timeout_ms);
}


int32_t GSM_AT_sync(uint32_t option)
{
	return 0;	
}

void OnURCHandler_QSECWRITE(const char* strURC, void* reserved)
{
	u8 *p;
	at_printd("%s",strURC);
	p=(u8*)Ql_strstr((const char *)strURC,"+QSECWRITE:");
	if(p!=NULL)
		{
			SSLWRITESTA|=1<<0;
		}
}

void OnURCHandler_QSSLOPEN(const char* strURC, void* reserved)
{
	u8 *p;
	at_printd("%s",strURC);
	p=(u8*)Ql_strstr((const char *)strURC,"+QSSLOPEN:");
	if(p!=NULL)
		{
			SSLWRITESTA|=1<<1;
		}
}


void OnURCHandler_QISEND(const char* strURC, void* reserved)
{
	u8 *p;
	at_print("%s",strURC);
	p=(u8*)Ql_strstr((const char *)strURC,"SEND");
	if(p!=NULL)
		{
			 p = Ql_strstr(strURC, "SEND OK");
			 if(p!=NULL)
			 	{
			 		SSLWRITESTA|=1<<2;
			 	}
			  p = Ql_strstr(strURC, "SEND FAIL");
			 if(p!=NULL)
			 	{
			 		SSLWRITESTA|=1<<3;
			 	}
		}
}

void OnURCHandler_QSSLURC(const char* strURC, void* reserved)
{
	u8 *p;
	char* inner_ptr = NULL;
	at_printd("%s",strURC);
	p=(u8*)Ql_strstr((const char *)strURC,"+QSSLURC:");
	if(p!=NULL)
		{
			  	inner_ptr = NULL;
		        inner_ptr = strstr(strURC, "\"recv\"");
		        if (inner_ptr != NULL)
		        {
		            SSLWRITESTA|=1<<4;
		        }
		        inner_ptr = strstr(strURC, "\"closed\"");
		        if (inner_ptr != NULL)
		        {
		            SSLWRITESTA|=1<<5;
		        }
		}
}


u8 WaitURCSSLRe(u8 waitnum,u32 timeout)
{
	u8 res=0;
	u16 t=timeout/10;
	while(--t)	
		{
			Ql_Sleep(10);
			if(SSLWRITESTA&waitnum)break;
		}
	SSLWRITESTA&=~waitnum;
	if(t==0)res=1;
	return res;
}


