LiChunM/m203c_sdk_vport_v1.2/cloud/zyf_mqtt_tracker_app/zyf_custom/m203c_module.c
s32 WaitQSSLURCRe(u8 waitnum1,u8 waitnum2,u32 timeout)
{
	s32 res=0;
	u16 t=timeout/10;
	while(--t)	
		{
			Ql_Sleep(10);
			if(SSLWRITESTA&waitnum1)
				{
					res=AT_URC_SSL_RECV;
					break;
				}
			if(SSLWRITESTA&waitnum2)
				{
					res=AT_URC_DISCONNECT;
					break;
				}
		}
	SSLWRITESTA&=~waitnum1;
	SSLWRITESTA&=~waitnum2;
	if(t==0)res=AT_ERROR_PARSE_FAIL;
	return res;
}



int32_t GSM_SSL_upload_CACert(const char* ca_cert, u32 ca_crt_len)
{
	 s32 at_ret;
    int32_t ret;
    uint32_t checksum = 0;
    uint32_t* sec_len = (uint32_t*)at_ret_data;
    at_printd("%s", __FUNCTION__);
#if defined(SSL_USE_SERVER_CERT) && (SSL_USE_SERVER_CERT == 1)
    //Check CA certificate is correct or not.
    at_ret = AT_cmd_send(AT_commands[AT_QSECREAD_cacert],Ql_strlen(AT_commands[AT_QSECREAD_cacert]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret == RIL_AT_SUCCESS)
    {
        at_printd("证书已存在\r\n");
        return 0;
    }
    ret = Ql_snprintf(at_cmd_buf, AT_CMD_LEN_MAX, AT_commands[AT_QSECWRITE_cacert], ca_crt_len);
    if ((ret < 0) || (ret > AT_CMD_LEN_MAX))
    {
        return __LINE__;
    }
    // Upload the CA certificate to RAM.
    at_printd("secwrite cmd\r\n");
    at_ret = AT_cmd_send(at_cmd_buf, Ql_strlen(at_cmd_buf),AT_resp_parser_QSECWRITE, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    at_printd("send cert %d bytes...", ca_crt_len);
    at_ret = Ql_RIL_WriteDataToCore(ca_cert, ca_crt_len);
    if (at_ret <0)
    {
        return __LINE__;
    }
    at_printd("check resp\r\n");
	SYSTEM_DELAY_MS(3000);
    at_ret = WaitURCSSLRe(1<<0,WAIT_5S);
   if (at_ret != 0)
    {
    	at_printd("证书写入出错");
        return __LINE__;
    }
#endif
    return 0;
}


int32_t GSM_SSL_transfer_mode_set()
{
    int32_t i;
    int32_t ret;
    s32 at_ret;
    uint32_t checksum = 0;
    uint32_t ca_cert_len = 0;
    uint32_t* mode = (uint32_t*)at_ret_data;
    at_printl("%s", __LINE__);
#if (SSL_SESSIONS_MODE == MULTIPLE_ENABLE)
    // 查询多路连接配置
    *mode = 0xff;
    at_ret = AT_cmd_send(AT_commands[AT_QIMUX_status], Ql_strlen(AT_commands[AT_QIMUX_status]),AT_resp_parser_QIMUX, mode, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    at_printl("muxmode=%d", *mode);
    if (*mode != SSL_SESSIONS_MODE)
    {
        // 如果当前是透传模式，必须先设置为非透传模式才能启用多路连接 否则指令报错
        // 查询模式
        *mode = 0xff;
        at_ret = AT_cmd_send(AT_commands[AT_QIMODE], Ql_strlen(AT_commands[AT_QIMODE]),AT_resp_parser_QIMODE, mode, AT_RESP_TIMEOUT_GENERAL);
        if (at_ret != RIL_AT_SUCCESS)
        {
            return __LINE__;
        }
        at_printl("imode=%d", *mode);
        if (*mode != NORMAL_MODE)
        {
            at_printl("set to NORMAL_MODE");
            // 配置模式
            at_ret = AT_cmd_send(AT_commands[AT_QIMODE0],Ql_strlen(AT_commands[AT_QIMODE0]), AT_resp_parser_QIMODE, NULL, AT_RESP_TIMEOUT_GENERAL);
            if (at_ret != RIL_AT_SUCCESS)
            {
                return __LINE__;
            }
        }
        //启用多路连接
        at_printl("MULTIPLE_ENABLE");
        at_ret = AT_cmd_send(AT_commands[AT_QIMUX_1], Ql_strlen(AT_commands[AT_QIMUX_1]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
        if (at_ret != RIL_AT_SUCCESS)
        {
            return __LINE__;
        }
    }
#elif (SSL_SESSIONS_MODE == MULTIPLE_DISABLE)
    // 查询多路连接配置
    *mode = 0xff;
    at_ret = AT_cmd_send(AT_commands[AT_QIMUX_status], Ql_strlen(AT_commands[AT_QIMUX_status]),AT_resp_parser_QIMUX, mode, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    at_printl("muxmode=%d", *mode);
    if (*mode != SSL_SESSIONS_MODE)
    {
        at_printl("MULTIPLE_DISABLE");
        // 禁用多路连接
        at_ret = AT_cmd_send(AT_commands[AT_QIMUX_0], Ql_strlen(AT_commands[AT_QIMUX_0]), AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
        if (at_ret != RIL_AT_SUCCESS)
        {
            return __LINE__;
        }
    }
#else
#warning TCPIP_SESSIONS_MODE Not defined
    at_printl("多路连接未配置");
#endif
#if (SSL_TRANSFER_MODE == NORMAL_MODE)
    // 查询模式
    *mode = 0xff;
    at_ret = AT_cmd_send(AT_commands[AT_QIMODE],  Ql_strlen(AT_commands[AT_QIMODE]),AT_resp_parser_QIMODE, mode, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    at_printl("imode=%d", *mode);
    if (*mode != SSL_TRANSFER_MODE)
    {
        at_printl("NORMAL_MODE");
        // 配置模式
        at_ret = AT_cmd_send(AT_commands[AT_QIMODE0], Ql_strlen(AT_commands[AT_QIMODE0]), AT_resp_parser_QIMODE, NULL, AT_RESP_TIMEOUT_GENERAL);
        if (at_ret != RIL_AT_SUCCESS)
        {
            return __LINE__;
        }
    }
#elif (SSL_TRANSFER_MODE == TRANSPARENT_MODE)
    // 先查询模式
    *mode = 0xff;
    at_ret = AT_cmd_send(AT_commands[AT_QIMODE],  Ql_strlen(AT_commands[AT_QIMODE]),AT_resp_parser_QIMODE, mode, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != 0)
    {
        return __LINE__;
    }
    at_printl("imode=%d", *mode);
    if (*mode != TCPIP_TRANSFER_MODE)
    {
        at_printl("TRANSPARENT_MODE");
        // 配置模式
        at_ret = AT_cmd_send(AT_commands[AT_QIMODE1], Ql_strlen(AT_commands[AT_QIMODE1]), AT_resp_parser_QIMODE, NULL, AT_RESP_TIMEOUT_GENERAL);
        if (at_ret != RIL_AT_SUCCESS)
        {
            return __LINE__;
        }
    }
#else
#warning TCPIP_TRANSFER_MODE Not defined
    at_printl("TCP传输模式未配置");
#endif
    return 0;
}

int32_t GSM_GPRS_activate_pdp()
{
	s32 at_ret;
    int32_t i;
    int32_t ret;
    uint32_t checksum = 0;
    uint32_t ca_cert_len = 0;
    at_printl("%s", __FUNCTION__);

    // Deactivate GPRS PDP context.
    at_ret = AT_cmd_send(AT_commands[AT_QIDEACT], Ql_strlen(AT_commands[AT_QIDEACT]),AT_resp_parser_QIDEACT, NULL, AT_RESP_TIMEOUT_40S);
   // if (at_ret != RIL_AT_SUCCESS)
   // {
   //		 at_printl("at_ret=%d", at_ret);
   //     return __LINE__;
   // }

    // 查询信号质量
    for (i = 0; i < 10; i++)
    {
        at_ret = AT_cmd_send(AT_commands[AT_CSQ],Ql_strlen(AT_commands[AT_CSQ]), AT_resp_parser_CSQ, NULL, AT_RESP_TIMEOUT_GENERAL);
        if (at_ret == RIL_AT_SUCCESS)
        {
            break;
        }
    }
    // 信号质量不通过
    if (i >= 10)
    {
        return __LINE__;
    }
    // 查询sim卡状态
    at_ret = AT_cmd_send(AT_commands[AT_CPIN], Ql_strlen(AT_commands[AT_CPIN]),AT_resp_parser_CPIN, NULL, AT_RESP_TIMEOUT_5S);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
	
