LiChunM/m203c_sdk_vport_v1.2/cloud/zyf_mqtt_tracker_app/zyf_custom/m203c_module.c
#if 0	
    // 查询网络注册状态
    if (GSM_CheckCellularNetwork())
    {
        return __LINE__;
    }
	
#endif
	
    //Set context 0 as foreground context.
    // OK
    at_ret = AT_cmd_send(AT_commands[AT_QIFGCNT0], Ql_strlen(AT_commands[AT_QIFGCNT0]), AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    //Set bearer type as GPRS and the APN is
    // “CMNET", no username and password for the
    // APN.
    // OK
    at_ret = AT_cmd_send(AT_commands[AT_QICSGP], Ql_strlen(AT_commands[AT_QICSGP]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    //Register to TCP/IP stack.
    // OK
    at_ret = AT_cmd_send(AT_commands[AT_QIREGAPP], Ql_strlen(AT_commands[AT_QIREGAPP]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }

	Ql_Sleep(300);
    //Activate GPRS PDP context.
    // OK
    at_ret = AT_cmd_send(AT_commands[AT_QIACT],Ql_strlen(AT_commands[AT_QIACT]), AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_150S);
   if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
   	}

#if 0	
    if (0 != GSM_AT_sync(0))
    {
        return __LINE__;
    }
#endif
	
    //Query the local IP address.
    at_ret = AT_cmd_send(AT_commands[AT_QILOCIP],Ql_strlen(AT_commands[AT_QILOCIP]), AT_resp_parse_QILOCIP, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    return 0;
}


int32_t GSM_SSL_config()
{
    int32_t ret;
    int32_t at_ret;
    uint32_t checksum = 0;
    uint32_t ca_cert_len = 0;
    uint32_t at_resp_len;
    int32_t status;
    at_printl("%s", __FUNCTION__);
    at_ret = AT_cmd_send(AT_commands[AT],Ql_strlen(AT_commands[AT]), AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    //Configure SSL version
    // context 0
    // TLS1.2
    // OK
    at_ret = AT_cmd_send(AT_commands[AT_QSSLCFG_sslversion], Ql_strlen(AT_commands[AT_QSSLCFG_sslversion]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    // AT+QSSLCFG="ciphersuite",0,"0XFFFF" //Configure ciphersuite
    at_ret = AT_cmd_send(AT_commands[AT_QSSLCFG_ciphersuite],Ql_strlen(AT_commands[AT_QSSLCFG_ciphersuite]), AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    // Configure the authentication mode
    at_ret = AT_cmd_send(AT_commands[AT_QSSLCFG_seclevel], Ql_strlen(AT_commands[AT_QSSLCFG_seclevel]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
#if defined(SSL_USE_SERVER_CERT) && (SSL_USE_SERVER_CERT == 1)
    //Check CA certificate is correct or not.
    at_ret = AT_cmd_send(AT_commands[AT_QSECREAD_cacert],Ql_strlen(AT_commands[AT_QSECREAD_cacert]), AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    // Configure CA certificate
    at_ret = AT_cmd_send(AT_commands[AT_QSSLCFG_cacert], Ql_strlen(AT_commands[AT_QSSLCFG_cacert]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
#endif
#if defined(SSL_USE_CLIENT_CERT) && (SSL_USE_CLIENT_CERT == 1)
    // Check client certificate is correct or not.
    at_ret = AT_cmd_send(AT_commands[AT_QSECREAD_clientcert],Ql_strlen(AT_commands[AT_QSECREAD_clientcert]), AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    //Configure client certificate.
    at_ret = AT_cmd_send(AT_commands[AT_QSSLCFG_clientcert], Ql_strlen(AT_commands[AT_QSSLCFG_clientcert]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
#endif
#if defined(SSL_USE_CLIENT_KEY) && (SSL_USE_CLIENT_KEY == 1)
    // Check client private key is correct or not.
    at_ret = AT_cmd_send(AT_commands[AT_QSECREAD_clientkey],Ql_strlen(AT_commands[AT_QSECREAD_clientkey]), AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    //Configure client key.
    at_ret = AT_cmd_send(AT_commands[AT_QSSLCFG_clientkey], Ql_strlen(AT_commands[AT_QSSLCFG_clientkey]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
#endif
    return 0;
}


int32_t GSM_SSL_open(const char* host, uint16_t port)
{
	 s32 at_ret;
    int32_t ret;
    uint32_t checksum = 0;
    uint32_t status = 0;
    uint32_t* mode = (uint32_t*)at_ret_data;
    tcpip_recv.total_length = 0;
    tcpip_recv.data_ptr = NULL;
    tcpip_recv.act_length = 0;
    tcp_printd("%s", __FUNCTION__);
    if (is_ip_domain(host) != 0)
    {
        // 设置输入为域名
        at_ret = AT_cmd_send(AT_commands[AT_QIDNSIP_domain], Ql_strlen(AT_commands[AT_QIDNSIP_domain]),AT_resp_parser_QIDNSIP, NULL, AT_RESP_TIMEOUT_GENERAL);
        if (at_ret != RIL_AT_SUCCESS)
        {
            return __LINE__;
        }
    }
    else
    {
        // 设置输入为ip
        at_ret = AT_cmd_send(AT_commands[AT_QIDNSIP_ip],Ql_strlen(AT_commands[AT_QIDNSIP_ip]), AT_resp_parser_QIDNSIP, NULL, AT_RESP_TIMEOUT_GENERAL);
        if (at_ret != RIL_AT_SUCCESS)
        {
            return __LINE__;
        }
    }
    // param:
    // Secure socket
    // SSL context index
    // Transparent mode
    // 120 second timeout. The default value is 90 seconds.
#if (SSL_TRANSFER_OPEN_MODE == NORMAL_MODE)
    ret = Ql_snprintf(at_cmd_buf, AT_CMD_LEN_MAX, AT_commands[AT_QSSLOPEN], host, port, NORMAL_MODE);
#else
#error SSL_TRANSFER_OPEN_MODE not support now.
#endif
    at_ret = AT_cmd_send(at_cmd_buf,Ql_strlen(at_cmd_buf), AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_75S);
    if (at_ret != RIL_AT_SUCCESS)
    {
        return __LINE__;
    }
    // 检查连接状态码
  	at_ret = WaitURCSSLRe(1<<1,AT_RESP_TIMEOUT_75S);
    if (at_ret != 0)
    {
    	at_printd("打开错误");
        return __LINE__;
    }

