LiChunM/m203c_sdk_vport_v1.2/cloud/zyf_mqtt_tracker_app/zyf_custom/m203c_module.c
#if 0
    if (*mode != 0)
    {
        return __LINE__;
    }
#endif
    return 0;
}


// SSL 发送数据
// 出错返回负值
int32_t GSM_SSL_transmit(const char* buf, uint32_t len, uint32_t timeout_ms)
{
    uint32_t i;
#if (SSL_TRANSFER_MODE == NORMAL_MODE)
    int32_t ret;
    int32_t at_ret;
    uint32_t checksum = 0;
    uint32_t status = 0;
    uint32_t at_resp_len;
    tcp_printd("%s", __FUNCTION__);
    if (0 != GSM_AT_sync(0))
    {
        tcp_printl("error %d", __LINE__);
        return -5;
    }
    // sslsend command
    ret = Ql_snprintf(at_cmd_buf, AT_CMD_LEN_MAX, AT_commands[AT_QSSLSEND], len);
    if ((ret < 0) || (ret > AT_CMD_LEN_MAX))
    {
        return -1;
    }
    at_printd("qsslsend cmd");
    at_ret = AT_cmd_send(at_cmd_buf,Ql_strlen(at_cmd_buf), AT_resp_parser_QISEND_Prepare, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != 0)
    {
        tcp_printl("error %d", __LINE__);
        return -2;
    }
    // 发送数据
    at_printd("send data %d bytes...", len);
    at_ret = Ql_RIL_WriteDataToCore(buf, len);
    if (at_ret <0)
    {
        tcp_printl("error %d", __LINE__);
        return -4;
    }
    at_printd("check resp");
    at_ret = WaitURCSSLRe(1<<2,AT_RESP_TIMEOUT_5S);
    if (at_ret != 0)
    {
        tcp_printl("error %d", __LINE__);
        return -3;
    }
#elif (SSL_TRANSFER_MODE == TRANSPARENT_MODE)
#error SSL TRANSPARENT_MODE not support.
#endif
    tcp_printd("qsslsend %d", len);
    return len;
}
// SSL 接收指定字节数据
int32_t GSM_SSL_retrieve(char* buf, uint32_t len, uint32_t timeout_ms)
{
    int i = 0;
    tcp_printd("%s", __FUNCTION__);
    tcp_printd("tmo=%d", timeout_ms);
    tcp_printd("len=%d", len);
#if (SSL_TRANSFER_MODE == NORMAL_MODE)
    int32_t ret;
    int32_t at_ret;
    uint32_t checksum = 0;
    uint32_t status = 0;
    uint32_t at_resp_len;
    if (tcpip_recv.total_length == 0)
    {
        // 等待收到数据
        tcp_printd("wait SSL-recv");
        at_ret = WaitQSSLURCRe(1<<4,1<<5,AT_RESP_TIMEOUT_75S);
        if (AT_URC_DISCONNECT == at_ret)
        {
            // TCP connection error occur.
            tcp_printl("connection error %d", __LINE__);
            return -2;
        }
        if (at_ret != AT_URC_SSL_RECV)
        {
            tcp_printl("error %d %d", at_ret, __LINE__);
            return 0;
        }
        tcpip_recv.total_length = 1;
    }

    if (0 != GSM_AT_sync(0))
    {
        tcp_printl("error %d", __LINE__);
        return -1;
    }

    tcp_printd("QSSLRECV cmd");
    // 读取数据 指令
    ret = Ql_snprintf(at_cmd_buf, AT_CMD_LEN_MAX, AT_commands[AT_QSSLRECV], 500);
    if ((ret < 0) || (ret > AT_CMD_LEN_MAX))
    {
        tcp_printl("gen cmd error %d", __LINE__);
        return -2;
    }
    tcpip_recv.data_ptr = buf;
    at_ret = AT_cmd_send(at_cmd_buf,Ql_strlen(at_cmd_buf), AT_resp_parser_QSSLRECV, &tcpip_recv, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != AT_SUCCESS)
    {
        tcp_printl("error %d %d", at_ret, __LINE__);
        tcpip_recv.total_length = 0;
        return -1;
    }
    if (tcpip_recv.act_length == 0)
    {
        tcpip_recv.total_length = 0;
    }
    return tcpip_recv.act_length;
#elif (SSL_TRANSFER_MODE == TRANSPARENT_MODE)
#error SSL TRANSPARENT_MODE not support.
#endif
}


int32_t GSM_SSL_close()
{
    int32_t ret;
    int32_t at_ret;
    uint32_t checksum = 0;
    uint32_t status = 0;
    uint32_t at_resp_len;
    tcp_printd("%s", __FUNCTION__);

    if (0 != GSM_AT_sync(0))
    {
        return __LINE__;
    }

    tcpip_recv.total_length = 0;
    // 查询连接状态
    at_ret = AT_cmd_send(AT_commands[AT_QSSLSTATE], Ql_strlen(AT_commands[AT_QSSLSTATE]),AT_resp_parser_QISTAT, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != 0)
    {
        return __LINE__;
    }
    // Close socket index
    at_ret = AT_cmd_send(AT_commands[AT_QSSLCLOSE_idx0], Ql_strlen(AT_commands[AT_QSSLCLOSE_idx0]), AT_resp_parser_QICLOSE, NULL, AT_RESP_TIMEOUT_5S);
    if (at_ret != 0)
    {
        //return __LINE__;
    }
    tcp_printd("ssl close ok");
    return 0;
}


int32_t GSM_SSL_delete_cert()
{
    int32_t ret;
    int32_t at_ret;
    uint32_t checksum = 0;
    uint32_t status = 0;
    uint32_t at_resp_len;
    tcp_printd("%s", __FUNCTION__);
#if defined(SSL_USE_SERVER_CERT) && (SSL_USE_SERVER_CERT == 1)
    // 删除 ca
    at_ret = AT_cmd_send(AT_commands[AT_QSECDEL_cacert], Ql_strlen(AT_commands[AT_QSECDEL_cacert]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != 0)
    {
        //return __LINE__;
    }
#endif
#if defined(SSL_USE_CLIENT_CERT) && (SSL_USE_CLIENT_CERT == 1)
    // 删除 证书
    at_ret = AT_cmd_send(AT_commands[AT_QSECDEL_clientcert],  Ql_strlen(AT_commands[AT_QSECDEL_clientcert]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != 0)
    {
        //return __LINE__;
    }
#endif
#if defined(SSL_USE_CLIENT_KEY) && (SSL_USE_CLIENT_KEY == 1)
    // 删除私钥
    at_ret = AT_cmd_send(AT_commands[AT_QSECDEL_clientkey],  Ql_strlen(AT_commands[AT_QSECDEL_clientkey]),AT_resp_parser_generic, NULL, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != 0)
    {
        //return __LINE__;
    }
#endif
    return 0;
}

int32_t GSM_deactivate_pdp()
{
    int32_t ret;
    int32_t at_ret;
    uint32_t checksum = 0;
    uint32_t status = 0;
    uint32_t at_resp_len;
    at_printl("%s", __FUNCTION__);

    if (0 != GSM_AT_sync(0))
    {
        return __LINE__;
    }

    // Deactivate GPRS PDP context.
    at_ret = AT_cmd_send(AT_commands[AT_QIDEACT], Ql_strlen(AT_commands[AT_QIDEACT]),AT_resp_parser_QIDEACT, NULL, AT_RESP_TIMEOUT_40S);
    if (at_ret != 0)
    {
        return __LINE__;
    }
    at_printl("Deactive ok");
    return 0;
}


int32_t GSM_GPRS_prepare(uint8_t* po_imei, uint8_t* po_ccid, uint8_t* po_imsi)
{
    int32_t ret;
    int32_t at_ret;
    uint32_t checksum = 0;
    uint32_t ca_cert_len = 0;
    uint32_t at_resp_len;
    int32_t i;
    uint8_t* p_ret_data = at_ret_data;

    if (GSM_AT_sync(0))
    {
        return __LINE__;
    }
    at_printl("%s", __FUNCTION__);

    // imei
    at_ret = AT_cmd_send(AT_commands[AT_GSN], Ql_strlen(AT_commands[AT_GSN]), AT_resp_parser_GSN, p_ret_data, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != 0)
    {
        return __LINE__;
    }
    at_printl("imei=%s", p_ret_data);
    if (po_imei)
        Ql_strncpy(po_imei, p_ret_data, strlen(p_ret_data));

    // 查询sim卡状态
    at_ret = AT_cmd_send(AT_commands[AT_CPIN],  Ql_strlen(AT_commands[AT_CPIN]),AT_resp_parser_CPIN, NULL, AT_RESP_TIMEOUT_5S);
    if (at_ret != 0)
    {
        return __LINE__;
    }

    // CCID
    at_ret = AT_cmd_send(AT_commands[AT_QCCID], Ql_strlen(AT_commands[AT_QCCID]), AT_resp_parser_QCCID, p_ret_data, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != 0)
    {
        return __LINE__;
    }
    at_printl("ccid=%s", p_ret_data);
    if (po_ccid)
        Ql_strncpy(po_ccid, p_ret_data, strlen(p_ret_data));

    // IMSI
    at_ret = AT_cmd_send(AT_commands[AT_CIMI], Ql_strlen(AT_commands[AT_CIMI]), AT_resp_parser_CIMI, p_ret_data, AT_RESP_TIMEOUT_GENERAL);
    if (at_ret != 0)
    {
        return __LINE__;
    }
    at_printl("imsi=%s", p_ret_data);
    if (po_imsi)
        Ql_strncpy(po_imsi, p_ret_data, strlen(p_ret_data));

    return 0;
}


